weapon_name = {
    0: '손', 1: '모래', 2: '돌', 3: '나무검', 4: '돌검', 5: '낫', 6: '망치', 7: '도끼', 8: '칼', 9: '노트북', 10: '톱',
    11: '쇠사슬', 12: '쇠막대기', 13: '철퇴', 14: '장궁', 15: '화살', 16: '창', 17: '방패', 18: '총', 19: '폭탄', 20: '미사일',
    21: '레이저건', 22: '수류탄', 23: '화염방사기', 24: '전기톱', 25: '레이저칼', 26: '독침', 27: '순간이동기', 28: '로켓런처', 29: '드론', 30: '자동소총',
    31: '저격총', 32: '기관총', 33: '핵폭탄', 34: 'EMP', 35: '가스폭탄', 36: '바이러스', 37: '생화학무기', 38: '사이버공격', 39: '위성무기', 40: '레일건',
    41: '플라즈마건', 42: '에너지 방패', 43: '얼음 방사기', 44: '초음파 무기', 45: '자기장 발생기', 46: '중력 폭탄', 47: '마이크로봇', 48: '나노머신', 49: '안개를 가르는 회광', 50: '시간 정지기',
    51: '블랙홀 생성기', 52: '양자 무기', 53: '메타 물질', 54: '암흑 물질', 55: '플라즈마 방패', 56: '안티 물질', 57: '태양 에너지 총', 58: '감마선 빔', 59: '중성자 폭탄', 60: '바이오 해킹', 
    61: '나노 로봇', 62: '인공 지능', 63: '가상 현실', 64: '홀로그램', 65: '레이저 드론', 66: '스팀펑크 메카', 67: '사이보그', 68: '유전자 조작', 69: '클론 군대', 70: '텔레포트',
    71: '오비탈 캐논', 72: '우주선', 73: '인공 블랙홀', 74: '우주 레이저', 75: '행성 파괴기', 76: '우주 방사기', 77: '다차원 포탈', 78: '양자 컴퓨터', 79: '인공태양', 80: '우주 정거장',
    81: '인공 웜홀', 82: '우주 전함', 83: '인공 지능 로봇', 84: '사이버네틱 파워 슈트', 85: '양자 폭탄', 86: '우주 드론', 87: '인공 중력', 88: '우주 미사일', 89: '항성간 미사일', 90: '우주 폭탄',
    91: '우주 레이저 건', 92: '우주 EMP', 93: '우주 가스폭탄', 94: '우주 바이러스', 95: '우주 생화학무기', 96: '우주 사이버공격', 97: '우주 위성무기', 98: '우주 레일건', 99: '우주 플라즈마건',
    100: '심판의 검'
}